---
kind: method
id: M:Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.Insert(Autodesk.Revit.DB.Electrical.GroundConductorSize)
source: html/49d782d4-c625-7794-295e-a94230d35960.htm
---
# Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.Insert Method

Insert the specified GroundConductorSize into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	GroundConductorSize item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.GroundConductorSize`) - The GroundConductorSize to be inserted into the set.

## Returns
Returns whether the GroundConductorSize was inserted into the set.